package com.example.migration;

import com.example.entity.ElectionsEntity;
import com.google.common.collect.Lists;

import java.util.List;

public class ElectionsMigration {

    public static List<ElectionsEntity> loadElections() {
        return Lists.newArrayList(
          new ElectionsEntity(null, "Республика Крым", "Севастополь", "Крым", "Досрочные Выборы губернатора города Севастополя", "2020"),
          new ElectionsEntity(null, "Брянская область", "Брянск", "Брянск", "Выборы губернатора Брянской области", "2020"),
          new ElectionsEntity(null, "Еврейская автономная область", "Биробиджан", "Биробиджан", "Выборы губернатора Еврейской автономной области", "2020"),
          new ElectionsEntity(null, "Республика Татарстан", "Казань", "Казань", "Выборы президента Республики Татарстан", "2020"),
          new ElectionsEntity(null, "Краснодарский край", "Краснодар", "Краснодар", "Выборы губернатора Краснодарского края", "2020"),
          new ElectionsEntity(null, "Ленинградская область", "Санкт-Петербург", "Питер", "Выборы губернатора Ленинградской области", "2020"),
          new ElectionsEntity(null, "Камчатский край", "Петропавловск-Камчатский", "Камчатка", "Выборы губернатора Камчатского края", "2020"),
          new ElectionsEntity(null, "Иркутская область", "Иркутск", "Иркутск", "Выборы губернатора Иркутской области", "2020"),
          new ElectionsEntity(null, "Костромская область", "Кострома", "Кострома", "Выборы губернатора Костромской области", "2020"),
          new ElectionsEntity(null, "Смоленская область", "Смоленск", "Смоленск", "Выборы губернатора Смоленской области", "2020"),
          new ElectionsEntity(null, "Архангельская область", "Архангельск", "Архангельск", "Выборы губернатора Архангельской области", "2020"),
          new ElectionsEntity(null, "Пензенская область", "Пенза", "Пенза", "Выборы губернатора Пензенской области", "2020"),
          new ElectionsEntity(null, "Тамбовская область", "Тамбов", "Тамбов", "Выборы главы администрации Тамбовской области", "2020"),
          new ElectionsEntity(null, "Ростовская область", "Ростов-на-Дону", "Ростов", "Выборы губернатора Ростовской области", "2020"),
          new ElectionsEntity(null, "Чувашская Республика", "Чебоксары", "Чувашия", "Выборы главы Чувашской Республики", "2020"),
          new ElectionsEntity(null, "Калужская область", "Калуга", "Калуга", "Выборы губернатора Калужской области", "2020"),
          new ElectionsEntity(null, "Республика Коми", "Сыктывкар", "Коми", "Выборы в Государственный совет Республики Коми", "2020"),
          new ElectionsEntity(null, "Белгородская область", "Белгород", "Белгород", "Выборы в Белгородскую областную думу (2020)", "2020"),
          new ElectionsEntity(null, "Воронежская область", "Воронеж", "Воронеж", "Выборы в Воронежскую областную думу", "2020"),
          new ElectionsEntity(null, "Калужская область", "Калуга", "Калуга", "Выборы в Законодательное собрание Калужской области", "2020"),
          new ElectionsEntity(null, "Костромская область", "Кострома", "Кострома", "Выборы в Костромскую областную думу", "2020"),
          new ElectionsEntity(null, "Курганская область", "Курган", "Курган", "Выборы в Курганскую областную думу", "2020"),
          new ElectionsEntity(null, "Магаданская область", "Магадан", "Магадан", "Выборы в Магаданскую областную думу", "2020"),
          new ElectionsEntity(null, "Новосибирская область", "Новосибирск", "Новосибирск", "Выборы в Законодательное собрание Новосибирской области", "2020"),
          new ElectionsEntity(null, "Рязанская область", "Рязань", "Рязань", "Выборы в Рязанскую областную думу", "2020"),
          new ElectionsEntity(null, "Челябинская область", "Челябинск", "Челябинск", "Выборы в Законодательное собрание Челябинской области", "2020"),
          new ElectionsEntity(null, "Ямало-Ненецкий АО", "Салехард", "Салехард", "Выборы в Законодательное собрание Ямало-Ненецкого автономного округа", "2020"),
          new ElectionsEntity(null, "Республика Коми", "Сыктывкар", "Сыктывкар", "Выборы в Совет муниципального образования городского округа «Сыктывкар»", "2020"),
          new ElectionsEntity(null, "Республика Татарстан", "Казань", "Казань", "Выборы в Казанскую городскую думу", "2020"),
          new ElectionsEntity(null, "Удмуртская Республика", "Ижевск", "Удмуртия", "Выборы в Городскую думу Ижевска", "2020"),
          new ElectionsEntity(null, "Чувашская Республика", "Чебоксары", "Чувашия", "Выборы в Чебоксарское городское собрание депутатов", "2020"),
          new ElectionsEntity(null, "Краснодарский край", "Краснодар", "Краснодар", "Выборы в Городскую думу Краснодара", "2020"),
          new ElectionsEntity(null, "Астраханская область", "Астрахань", "Астрахань", "Выборы в Городскую думу муниципального образования «Город Астрахань»", "2020"),
          new ElectionsEntity(null, "Владимирская область", "Владимир", "Владимир", "Выборы в Совет народных депутатов города Владимира", "2020"),
          new ElectionsEntity(null, "Воронежская область", "Воронеж", "Воронеж", "Выборы в Воронежскую городскую думу", "2020"),
          new ElectionsEntity(null, "Ивановская область", "Иваново", "Иваново", "Выборы в Ивановскую городскую думу", "2020"),
          new ElectionsEntity(null, "Калужская область", "Калуга", "Калуга", "Выборы в Городскую думу городского округа «Город Калуга»", "2020"),
          new ElectionsEntity(null, "Костромская область", "Кострома", "Кострома", "Выборы в Думу города Костромы", "2020"),
          new ElectionsEntity(null, "Липецкая область", "Липецк", "Липецк", "Выборы в Липецкий городской совет депутатов", "2020"),
          new ElectionsEntity(null, "Магаданская область", "Магадан", "Магадан", "Выборы в Магаданскую городскую думу", "2020"),
          new ElectionsEntity(null, "Нижегородская область", "Нижний Новгород", "Нижний Новогород", "Выборы в Городскую думу города Нижнего Новгорода", "2020"),
          new ElectionsEntity(null, "Новосибирская область", "Новосибирск", "Новосибирск", "Выборы в Совет депутатов города Новосибирска", "2020"),
          new ElectionsEntity(null, "Оренбургская область", "Оренбург", "Оренбург", "Выборы в Оренбургский городской совет", "2020"),
          new ElectionsEntity(null, "Орловская область", "Орёл", "Орел", "Выборы в Орловский городской совет народных депутатов", "2020"),
          new ElectionsEntity(null, "Ростовская область", "Ростов-на-Дону", "Ростов", "Выборы в Ростовскую-на-Дону городскую думу", "2020"),
          new ElectionsEntity(null, "Смоленская область", "Смоленск", "Смоленск", "Выборы в Смоленский городской совет", "2020"),
          new ElectionsEntity(null, "Тамбовская область", "Тамбов", "Тамбов", "Выборы в Тамбовскую городскую думу", "2020"),
          new ElectionsEntity(null, "Томская область", "Томск", "Томск", "Выборы в Думу города Томска", "2020"),
          new ElectionsEntity(null, "Ульяновская область", "Ульяновск", "Ульяновск", "Выборы в Ульяновскую городскую думу", "2020"),
          new ElectionsEntity(null, "Республика Дагестан", "Махачкала", "Дагестан", "Муниципальные выборы в Махачкале", "2020"),
          new ElectionsEntity(null, "Самарская область", "Самара", "Самара", "Муниципальные выборы в Самаре", "2020")
        );
    }

}
